# Условие

Шахматный ферзь ходит на любое количество клеток по диагонали, горизонтали или вертикали. Даны две
различные клетки на шахматной доске без фигур. Определите, может ли ферзь попасть с первой клетки на
вторую одним ходом.

*Формат ввода*
Программа получает на вход четыре целых числа от 1 до 8. Первая пара чисел задаёт номер столбца и номер строки для первой клетки. Вторая пара чисел аналогично задаёт вторую клетку.

*Формат вывода*
Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую, или NO в
противном случае.

*Пример 1*
Ввод                    Вывод

1                       YES
1
2
2

*Пример 2*
Ввод                    Вывод

1                       NO
1
2
3

# Мое решение

```cpp
#include <iostream>
#include <cmath>

int main() {
    int x1, y1, x2, y2;
    bool has_error = false;
    bool result = false;
    std::cin >> x1 >> y1 >> x2 >> y2;

    if (x1 < 1 || x1 > 8) {
        has_error = true;
    }
    if (y1 < 1 || y1 > 8) {
        has_error = true;
    }
    if (x2 < 1 || x2 > 8) {
        has_error = true;
    }
    if (y2 < 1 || y2 > 8) {
        has_error = true;
    }

    if (has_error) {
        std::cout << "NO" << std::endl;
        return 0;
    }

    if (x1 == x2) {
        result = true;
    }
    else if (y1 == y2) {
        result = true;
    }
    else if (std::abs(x2 - x1) == std::abs(y2 - y1)) {
        result = true;
    }

    if (result) {
        std::cout << "YES" << std::endl;
    } else {
        std::cout << "NO" << std::endl;
    }
}
```

# Варианты решения

```cpp
#include <cmath>
#include <iostream>

int main() {
    int x1, y1, x2, y2;
    std::cin >> x1 >> y1;
    std::cin >> x2 >> y2;

    if (x1 == x2 || y1 == y2 || std::abs(x1 - x2) == std::abs(y1 - y2)) {
        std::cout << "YES\n";
    } else {
        std::cout << "NO\n";
    }
}
```

# Выводы

1. Решения, в общем-то, совпадают, только нужно внимательно читать условия, т.к. проверка на поиск
ошибки не требуется, итак числа от 1 до 8.
