# Условие

Вычислите сумму цифр неотрицательного целого числа.

*Формат ввода*
На вход подаётся одно неотрицательное целое число, не превосходящее 10^9.

Формат вывода
Выведите сумму цифр этого числа.

# Мое решение

```cpp
#include <iostream>

int main() {
    unsigned int number;
    unsigned int result = 0;
    std::cin >> number;

    while (number) {
        result += number % 10;
        number /= 10; 
    }
    std::cout << result << std::endl;
}
```

# Варианты решения

Можно считать строку, а потом посимвольно складывать цифры:

```cpp
#include <iostream>
#include <string>

int main() {
    std::string digits;
    std::cin >> digits;

    int s = 0;
    for (char digit : digits) {
        s += digit - '0';
    }

    std::cout << s << "\n";
}
```
